// backtick
// 就是鍵盤左上角esc下方的那個鍵(跟~同一格)，用``包住的東西都會變成字串
// 可以用來取代單引號和雙引號
// 在backtick中可以用$加上{}構成佔位符號，裡面可以傳入變數的值或return的值
// 讓我們可以在普通字串內嵌運算式

let myName = "Joan";
let age = 22;
let address = "屏東";
function birthYear(num) {
  return 2023 - num;
}

// =====================================================================================================================================================
// backtick寫法

let meUseBacktick = `我的名字是${myName}，我是在${birthYear(
  age
)}年出生的，我的年齡為${age}，我來自${address}`;
console.log(meUseBacktick); // 我的名字是Joan，我是在2001年出生的，我的年齡為22，我來自屏東

// =====================================================================================================================================================
// 普通寫法

let me =
  "我的名字是" +
  myName +
  "，我是在" +
  birthYear(age) +
  "年出生的" +
  "，我的年齡為" +
  age +
  "，我來自" +
  address;

console.log(me); // 我的名字是Joan，我是在2001年出生的，我的年齡為22，我來自屏東
